Microchip-MPLAB-Harmony/csp/apps/twihs/master/twihs_eeprom/firmware/src/packs/ATSAMV71Q21B_DFP/component/icm.h
/* -------- ICM_UASR : (ICM Offset: 0x20) (R/  32) Undefined Access Status Register -------- */
#define ICM_UASR_URAT_Pos                     (0U)                                           /**< (ICM_UASR) Undefined Register Access Trace Position */
#define ICM_UASR_URAT_Msk                     (0x7U << ICM_UASR_URAT_Pos)                    /**< (ICM_UASR) Undefined Register Access Trace Mask */
#define ICM_UASR_URAT(value)                  (ICM_UASR_URAT_Msk & ((value) << ICM_UASR_URAT_Pos))
#define   ICM_UASR_URAT_UNSPEC_STRUCT_MEMBER_Val (0U)                                           /**< (ICM_UASR) Unspecified structure member set to one detected when the descriptor is loaded.  */
#define   ICM_UASR_URAT_ICM_CFG_MODIFIED_Val  (1U)                                           /**< (ICM_UASR) ICM_CFG modified during active monitoring.  */
#define   ICM_UASR_URAT_ICM_DSCR_MODIFIED_Val (2U)                                           /**< (ICM_UASR) ICM_DSCR modified during active monitoring.  */
#define   ICM_UASR_URAT_ICM_HASH_MODIFIED_Val (3U)                                           /**< (ICM_UASR) ICM_HASH modified during active monitoring  */
#define   ICM_UASR_URAT_READ_ACCESS_Val       (4U)                                           /**< (ICM_UASR) Write-only register read access  */
#define ICM_UASR_URAT_UNSPEC_STRUCT_MEMBER    (ICM_UASR_URAT_UNSPEC_STRUCT_MEMBER_Val << ICM_UASR_URAT_Pos) /**< (ICM_UASR) Unspecified structure member set to one detected when the descriptor is loaded. Position  */
#define ICM_UASR_URAT_ICM_CFG_MODIFIED        (ICM_UASR_URAT_ICM_CFG_MODIFIED_Val << ICM_UASR_URAT_Pos) /**< (ICM_UASR) ICM_CFG modified during active monitoring. Position  */
#define ICM_UASR_URAT_ICM_DSCR_MODIFIED       (ICM_UASR_URAT_ICM_DSCR_MODIFIED_Val << ICM_UASR_URAT_Pos) /**< (ICM_UASR) ICM_DSCR modified during active monitoring. Position  */
#define ICM_UASR_URAT_ICM_HASH_MODIFIED       (ICM_UASR_URAT_ICM_HASH_MODIFIED_Val << ICM_UASR_URAT_Pos) /**< (ICM_UASR) ICM_HASH modified during active monitoring Position  */
#define ICM_UASR_URAT_READ_ACCESS             (ICM_UASR_URAT_READ_ACCESS_Val << ICM_UASR_URAT_Pos) /**< (ICM_UASR) Write-only register read access Position  */
#define ICM_UASR_Msk                          (0x00000007UL)                                 /**< (ICM_UASR) Register Mask  */

/* -------- ICM_DSCR : (ICM Offset: 0x30) (R/W 32) Region Descriptor Area Start Address Register -------- */
#define ICM_DSCR_DASA_Pos                     (6U)                                           /**< (ICM_DSCR) Descriptor Area Start Address Position */
#define ICM_DSCR_DASA_Msk                     (0x3FFFFFFU << ICM_DSCR_DASA_Pos)              /**< (ICM_DSCR) Descriptor Area Start Address Mask */
#define ICM_DSCR_DASA(value)                  (ICM_DSCR_DASA_Msk & ((value) << ICM_DSCR_DASA_Pos))
#define ICM_DSCR_Msk                          (0xFFFFFFC0UL)                                 /**< (ICM_DSCR) Register Mask  */

/* -------- ICM_HASH : (ICM Offset: 0x34) (R/W 32) Region Hash Area Start Address Register -------- */
#define ICM_HASH_HASA_Pos                     (7U)                                           /**< (ICM_HASH) Hash Area Start Address Position */
#define ICM_HASH_HASA_Msk                     (0x1FFFFFFU << ICM_HASH_HASA_Pos)              /**< (ICM_HASH) Hash Area Start Address Mask */
#define ICM_HASH_HASA(value)                  (ICM_HASH_HASA_Msk & ((value) << ICM_HASH_HASA_Pos))
#define ICM_HASH_Msk                          (0xFFFFFF80UL)                                 /**< (ICM_HASH) Register Mask  */

/* -------- ICM_UIHVAL : (ICM Offset: 0x38) ( /W 32) User Initial Hash Value 0 Register 0 -------- */
#define ICM_UIHVAL_VAL_Pos                    (0U)                                           /**< (ICM_UIHVAL) Initial Hash Value Position */
#define ICM_UIHVAL_VAL_Msk                    (0xFFFFFFFFU << ICM_UIHVAL_VAL_Pos)            /**< (ICM_UIHVAL) Initial Hash Value Mask */
#define ICM_UIHVAL_VAL(value)                 (ICM_UIHVAL_VAL_Msk & ((value) << ICM_UIHVAL_VAL_Pos))
#define ICM_UIHVAL_Msk                        (0xFFFFFFFFUL)                                 /**< (ICM_UIHVAL) Register Mask  */

/** \brief ICM register offsets definitions */
#define ICM_CFG_OFFSET                 (0x00)         /**< (ICM_CFG) Configuration Register Offset */
#define ICM_CTRL_OFFSET                (0x04)         /**< (ICM_CTRL) Control Register Offset */
#define ICM_SR_OFFSET                  (0x08)         /**< (ICM_SR) Status Register Offset */
#define ICM_IER_OFFSET                 (0x10)         /**< (ICM_IER) Interrupt Enable Register Offset */
#define ICM_IDR_OFFSET                 (0x14)         /**< (ICM_IDR) Interrupt Disable Register Offset */
#define ICM_IMR_OFFSET                 (0x18)         /**< (ICM_IMR) Interrupt Mask Register Offset */
#define ICM_ISR_OFFSET                 (0x1C)         /**< (ICM_ISR) Interrupt Status Register Offset */
#define ICM_UASR_OFFSET                (0x20)         /**< (ICM_UASR) Undefined Access Status Register Offset */
#define ICM_DSCR_OFFSET                (0x30)         /**< (ICM_DSCR) Region Descriptor Area Start Address Register Offset */
#define ICM_HASH_OFFSET                (0x34)         /**< (ICM_HASH) Region Hash Area Start Address Register Offset */
#define ICM_UIHVAL_OFFSET              (0x38)         /**< (ICM_UIHVAL) User Initial Hash Value 0 Register 0 Offset */

/** \brief ICM register API structure */
typedef struct
{
  __IO  uint32_t                       ICM_CFG;         /**< Offset: 0x00 (R/W  32) Configuration Register */
  __O   uint32_t                       ICM_CTRL;        /**< Offset: 0x04 ( /W  32) Control Register */
  __I   uint32_t                       ICM_SR;          /**< Offset: 0x08 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       ICM_IER;         /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       ICM_IDR;         /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       ICM_IMR;         /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       ICM_ISR;         /**< Offset: 0x1c (R/   32) Interrupt Status Register */
  __I   uint32_t                       ICM_UASR;        /**< Offset: 0x20 (R/   32) Undefined Access Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       ICM_DSCR;        /**< Offset: 0x30 (R/W  32) Region Descriptor Area Start Address Register */
  __IO  uint32_t                       ICM_HASH;        /**< Offset: 0x34 (R/W  32) Region Hash Area Start Address Register */
  __O   uint32_t                       ICM_UIHVAL[8];   /**< Offset: 0x38 ( /W  32) User Initial Hash Value 0 Register 0 */
} icm_registers_t;
/** @}  end of Integrity Check Monitor */

#endif /* SAMV_SAMV71_ICM_MODULE_H */

